'''
1285. 아름이의 돌 던지기

아름이를 포함하여 총 N명의 사람이 돌 던지기 게임을 하고 있다.
이 돌 던지기 게임은 앞으로 돌을 던져 원하는 지점에 최대한 가깝게 돌을 던지는 게임이다.
정확하게 말하면 밀리미터 단위로 -100,000에서 100,000까지의 숫자가 일렬로 써져 있을 때, 사람들은 숫자 100,000이 써져 있는 위치에 서서 최대한 0에 가까운 위치로 돌을 던지려고 한다.
N명의 사람들이 던진 돌이 떨어진 위치를 측정한 자료가 주어질 때, 가장 0에 가깝게 돌이 떨어진 위치와 0 사이의 거리 차이와 몇 명이 그렇게 돌을 던졌는지를 구하는 프로그램을 작성하라.

첫 번째 줄에 테스트 케이스의 수 T가 주어진다.
각 테스트 케이스의 첫 번째 줄에는 돌을 던지는 사람의 수 N(1≤N≤1,000)이 주어진다.
두 번째 줄에는 각 사람이 돌을 던졌을 때 돌이 떨어진 위치를 나타내는 N개의 정수가 공백으로 구분되어 주어진다.
모든 사람이 돌을 그럭저럭 잘 던졌기 때문에, 돌이 떨어지는 위치는 항상   -100,000에서 100,000사이 범위의 정수이다. (-100,000과 100,000도 돌이 떨어질 수 있다.)
'''
# 테스트 케이스 수
t = int(input())
test_case = []
for _ in range(t):
    n = int(input())
    test_case.append(list(map(int, input().split())))

for i, test in enumerate(test_case, start=1):
    # 가장 0에 가까운 거리 초기화
    winner = test[0]

    for num in test:
        # num의 절대값이 winner의 절대값보다 작으면
        # 0에 더 가깝다는 뜻이기 때문에 winner를 num으로 바꿔준다.
        if abs(num) < abs(winner):
            winner = num
    # 같은 거리를 던진 수를 세기 위해서는 음수와 양수 모두 세야 한다. 
    winner_count = test.count(winner) + test.count(-winner)

    print(f'#{i} {abs(winner)} {winner_count}')

'''
[입력]
2
2
-100 100
3
-5 -1 3

[출력]
#1 100 2
#2 1 1
'''